#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

```terraform

Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
terraform-scripts relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/quarkiverse-devops/quarkiverse-devops/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/quarkiverse-devops/quarkiverse-devops

To view this run in a browser, visit:
https://app.terraform.io/app/quarkiverse/quarkiverse-devops/runs/run-u3nPFsPSiVMJUJvP

Waiting for the plan to start...

Terraform v1.8.5
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_repository.quarkus_roq will be created
  + resource "github_repository" "quarkus_roq" {
      + allow_auto_merge            = false
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archive_on_destroy          = true
      + archived                    = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "An extension to generate/publish static pages from your Quarkus web-app"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = true
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "quarkus-roq"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "blog",
          + "generate",
          + "generator",
          + "quarkus-extension",
          + "site",
          + "ssg",
          + "static",
          + "web",
        ]
      + visibility                  = (known after apply)
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false
    }

  # github_repository.quarkus_statiq will be destroyed
  # (because github_repository.quarkus_statiq is not in configuration)
  - resource "github_repository" "quarkus_statiq" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = true -> null
      - archive_on_destroy          = true -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = true -> null
      - description                 = "An extension to generate/publish static pages from your Quarkus web-app" -> null
      - etag                        = "W/"396a221490f3772a0e40a3591132705899e1d0194e454f78465dd88ac51de8ef"" -> null
      - full_name                   = "quarkiverse/quarkus-statiq" -> null
      - git_clone_url               = "git://github.com/quarkiverse/quarkus-statiq.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = true -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/quarkiverse/quarkus-statiq" -> null
      - http_clone_url              = "https://github.com/quarkiverse/quarkus-statiq.git" -> null
      - id                          = "quarkus-statiq" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "quarkus-statiq" -> null
      - node_id                     = "R_kgDOL4WdMA" -> null
      - primary_language            = "Java" -> null
      - private                     = false -> null
      - repo_id                     = 797285680 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:quarkiverse/quarkus-statiq.git" -> null
      - svn_url                     = "https://github.com/quarkiverse/quarkus-statiq" -> null
      - topics                      = [
          - "blog",
          - "generate",
          - "quarkus-extension",
          - "static",
          - "web",
        ] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = true -> null
      - web_commit_signoff_required = false -> null
        # (1 unchanged attribute hidden)

      - security_and_analysis {
          - secret_scanning {
              - status = "disabled" -> null
            }
          - secret_scanning_push_protection {
              - status = "disabled" -> null
            }
        }
    }

  # github_team.quarkus_roq will be created
  + resource "github_team" "quarkus_roq" {
      + create_default_maintainer = false
      + description               = "roq team"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "quarkiverse-roq"
      + node_id                   = (known after apply)
      + parent_team_id            = "5344029"
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.quarkus_statiq will be destroyed
  # (because github_team.quarkus_statiq is not in configuration)
  - resource "github_team" "quarkus_statiq" {
      - create_default_maintainer = false -> null
      - description               = "statiq team" -> null
      - etag                      = "W/"1c76993ff9c13493dc313e2886709d8a54b93667bba28032d17dba7eed8e6197"" -> null
      - id                        = "10058418" -> null
      - members_count             = 1 -> null
      - name                      = "quarkiverse-statiq" -> null
      - node_id                   = "T_kwDOBB_IY84AmXqy" -> null
      - parent_team_id            = "5344029" -> null
      - parent_team_read_id       = "5344029" -> null
      - parent_team_read_slug     = "quarkiverse-members" -> null
      - privacy                   = "closed" -> null
      - slug                      = "quarkiverse-statiq" -> null
        # (1 unchanged attribute hidden)
    }

  # github_team_membership.quarkus_roq["ia3andy"] will be created
  + resource "github_team_membership" "quarkus_roq" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "ia3andy"
    }

  # github_team_membership.quarkus_roq["mcruzdev"] will be created
  + resource "github_team_membership" "quarkus_roq" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "mcruzdev"
    }

  # github_team_membership.quarkus_roq["melloware"] will be created
  + resource "github_team_membership" "quarkus_roq" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "maintainer"
      + team_id  = (known after apply)
      + username = "melloware"
    }

  # github_team_membership.quarkus_statiq["ia3andy"] will be destroyed
  # (because github_team_membership.quarkus_statiq is not in configuration)
  - resource "github_team_membership" "quarkus_statiq" {
      - etag     = "W/"3286a72ecd2752fd2bd4d74284c0b2df9c400a9072926a80c494d5f349bbfe7c"" -> null
      - id       = "10058418:ia3andy" -> null
      - role     = "maintainer" -> null
      - team_id  = "10058418" -> null
      - username = "ia3andy" -> null
    }

  # github_team_repository.quarkus_roq will be created
  + resource "github_team_repository" "quarkus_roq" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "maintain"
      + repository = "quarkus-roq"
      + team_id    = (known after apply)
    }

  # github_team_repository.quarkus_statiq will be destroyed
  # (because github_team_repository.quarkus_statiq is not in configuration)
  - resource "github_team_repository" "quarkus_statiq" {
      - etag       = "W/"9743bdabbd62ce764e132efc109fe9f8151807174d18a065d536bd4d5153c097"" -> null
      - id         = "10058418:quarkus-statiq" -> null
      - permission = "maintain" -> null
      - repository = "quarkus-statiq" -> null
      - team_id    = "10058418" -> null
    }

Plan: 6 to add, 0 to change, 4 to destroy.

```

*Pusher: @ia3andy, Action: `pull_request`, Workflow: `Terraform`*